Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། གྲོང་རྡལ་གྱི་མི་དང་། ཡུལ་གྱི་མི་རྣམས་ཀྱིས་ཡིད་བརྟན་དུ་རུང་བ་ཡིན་ཏེ།
en: Brahmins, royalty, townspeople, and country dwellers can all rely on a bodhisattva.

source: བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། གྲོང་རྡལ་གྱི་མི་དང་། ཡུལ་གྱི་མི་རྣམས་
en: brahmins, royalty, townspeople, or country dwellers

source: འགྲོན་བུ་དང་། གསེར་དང་ནོར་བུ་དང་། མུ་ཏིག་དང་བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་བྱི་རུ་ལ་སོགས་པ་ནོར་དང་། ཡོ་བྱད་ཀྱི་རྣམ་པ་དག་འདེབས་ཀྱང་།
en: place any of their wealth or possessions, such as cowry shells, gold, precious stones, pearls, beryl, conchs, crystals, or corals,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་གཅིག་པུ་གཉིས་སུ་མེད་པ་ལ་
en: before a bodhisattva with no one else around,

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བརྣབ་སེམས་ཀྱང་མི་སྐྱེད་དོ།
en: the bodhisattva will not covet any of it.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་མཆོད་རྟེན་གྱིའམ། དགེ་འདུན་གྱི་དངོས་པོའི་ཕྱིར་ལས་སུ་བསྐོས་ན་ཡང་དངོས་པོ་དེས་ཀྱང་ཉེ་བར་མི་འཚོ་སྟེ།
en: If certain things have been dedicated to a shrine or to the saṅgha then bodhisattvas will not partake of them.

source: དེ་འདི་སྙམ་དུ་སེམས་ཤིང་
en: Instead they will think,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་ནི་བདག་གི་ལུས་ལས་ཤ་ཟོས་ཀྱང་བླའི་གཞན་གྱི་ཟས་སམ། སྐོམ་འམ། ཡོ་བྱད་ཀྱི་རྣམ་པ་གང་ཅི་ཡང་རུང་བ་དག་མ་བྱིན་ལ། མ་གནང་བར་སྤྱད་པ་ནི་མི་རུང་ངོ་ཞེས་གསུངས་སོ་
en: ‘The Blessed One has explained that bodhisattvas would rather consume their own flesh than frivolously partake of others’ food, drink, or possessions if they haven’t been given to them.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་པར་ལྟ་བ་ཡིན་ནོ།
en: Such is the bodhisattvas’ consideration of danger.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བླངས་པ་ལ་བརྟན་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ steadfast commitment consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་གཙེས་སམ། ནོར་དང་། འཁྲིག་པའི་ཡན་ལག་གིས་བརྗོད་ཀྱང་
en: When māras or demonic gods befriend bodhisattvas and speak to them about wealth and sex,

source: མི་གཡོ་མི་འགྱུར་ཞིང་ཉམས་པར་མི་འགྱུར་ཏེ།
en: they will remain immutable and unchanged, without any damage to their vows.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བླངས་པ་ལ་བརྟན་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ steadfast commitment.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་གནས་པའི་ཚུལ་ཁྲིམས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ open-ended discipline consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་སྲུང་ན།
en: When bodhisattvas observe discipline,

source: འདིས་བདག་ལྷར་ཤོག་ཤིག་ཅེ་འམ། ལྷ་ལ་ལར་ཤོག་ཤིག་ཅེ་འམ། རྒྱལ་པོར་ཤོག་ཤིག་ཅེ་འམ། རྒྱལ་པོ་ལ་ལར་ཤོག་ཤིག་ཅེས་སེམས་མི་སྐྱེད་དེ།
en: they do not harbor any wish that it may bring them birth as a god in general, or a specific god, or as royalty, or as some specific king.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་གནས་པའི་ཚུལ་ཁྲིམས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ open-ended discipline.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the nature of the bodhisattvas’ discipline that is purified of the three spheres.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཀྱིས་ཡོངས་སུ་དག་པ་ཡིན། ངག་དང་ཡིད་ཀྱིས་ཡོངས་སུ་དག་པ་ཡིན་ཏེ།
en: Bodhisattvas are physically, verbally, and mentally pure.

source: ཇི་ལྟར་ན་ལུས་ཀྱིས་ཡོངས་སུ་དག་པ་ཡིན་ཞེ་ན།
en: In what sense are they physically pure?

source: དེ་གང་ལུས་ཀྱིས་ངན་དུ་སྤྱོད་པ་འདི་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་སྟེ།
en: By giving up all negative physical acts.

source: ལུས་ཀྱིས་ངན་དུ་སྤྱོད་པ་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: What are the negative physical acts?

source: འདི་ལྟ་སྟེ་སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྟེ།
en: They are killing, taking what has not been given, and sexual misconduct.

source: དེ་ལྟར་ན་ལུས་ཀྱིས་ཡོངས་སུ་དག་པ་ཡིན་ནོ།
en: Such is their physical purity.

source: ཇི་ལྟར་ན་ངག་གིས་ཡོངས་སུ་དག་པ་ཡིན་ཞེ་ན།
en: How are they verbally pure?

source: དེ་གང་འདི་དག་ངག་གིས་ངན་དུ་སྤྱོད་པ་དེ་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་སྟེ།
en: By giving up all negative verbal acts.

source: སྤྱོད་པ་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: What are such acts?

source: འདི་ལྟ་སྟེ། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཚིག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་སྟེ།
en: They are lying, divisive talk, harsh words, and chatter.

source: དེ་ལྟར་ན་ངག་གིས་ཡོངས་སུ་དག་པ་ཡིན་ནོ།
en: Such is their verbal purity.

source: ཇི་ལྟར་ན་ཡིད་ཀྱིས་ཡོངས་སུ་དག་པ་ཡིན་ཞེ་ན།
en: How are they mentally pure?

source: དེ་གང་འདི་དག་ཡིད་ཀྱིས་ངན་དུ་སྤྱོད་པ་དེ་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་སྟེ།
en: By giving up all negative mental acts.

source: འདི་ལྟ་སྟེ། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བའོ།
en: They are covetousness, ill will, and wrong view.

source: དེ་ལྟར་ན་ཡིད་ཀྱིས་ཡོངས་སུ་དག་པ་ཡིན་ཏེ།
en: Such is their mental purity.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་ཅན་ཡིན་ནོ།
en: Noble son, such is the bodhisattvas’ discipline purified of the three spheres.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities observe excellent discipline.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who practice excellent patience possess ten qualities.

source: འདི་ལྟ་སྟེ་ནང་གི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: They are excellent inner patience,

source: ཕྱིའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent outer patience,

source: ཆོས་ཀྱི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent patience with respect to the Dharma,

source: སངས་རྒྱས་ཀྱིས་གནང་བའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent patience granted by the Buddha,

source: ཉི་ཚེ་བ་མ་ཡིན་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent patience that is not temporary,

source: ཐ་དད་པ་མེད་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent patience that does not differentiate,

source: དགོས་པ་ལ་མི་ལྟ་བའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent patience that is not concerned with a purpose,

source: རྣམ་པར་མི་འཁྲུགས་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent unperturbed patience,

source: སྙིང་རྗེའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: excellent compassionate patience,

source: དམ་བཅས་པ་ལས་སྒྲོལ་བར་བྱེད་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: and excellent patience that liberates based on a commitment.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ནང་གི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder what the bodhisattvas’ excellent inner patience consists in.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་
en: Noble son, bodhisattvas are

source: བཟོད་ཅིང་དང་དུ་ལེན་ལ་ཡོངས་སུ་ཡི་མི་འཆད་དེ།
en: continuously patient and accepting

source: ནང་གི་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་དེ་དག་
en: internal suffering, lamentation, pain, mental unease, or disturbance.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ནང་གི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent inner patience.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent outer patience consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་མ་ལས་སྨོས་པ་འམ། ཕ་ལས་སྨོས་པ་འམ། ཉེ་དུ་ལས་སྨོས་པ་འམ། མཁན་པོ་ལས་སྨོས་པ་འམ། སློབ་དཔོན་ལས་སྨོས་པའི་ཚིག་གི་ལམ་ངན་དུ་བརྗོད་པ་དང་།
en: A bodhisattva’s mother, father, relative, preceptor, or master might speak and express themselves in a way that is derogatory.

source: ངན་དུ་སྨྲས་པ་ཕ་རོལ་ལས་ཐོས་སམ། སངས་རྒྱས་སམ། ཆོས་སམ། དགེ་འདུན་ལ་མི་སྙན་པ་བརྗོད་པ་ཐོས་ན།
en: If bodhisattvas hear such words from others, or if they hear unpleasant words about the Buddha, the Dharma, or the Saṅgha,

source: མི་ཁྲོ་ཞིང་གནོད་པར་མི་སེམས་ལ་ཁོན་དུ་མི་འཛིན་ཏེ།
en: they will not become angry, develop ill will, or hold a grudge.

source: དེ་བཟོད་ཅིང་དང་དུ་ལེན་ལ་གནོད་སེམས་མི་མང་བ་ཡིན་ཏེ།
en: With patient acceptance they do not develop any malicious intent.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent outer patience.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent patience with respect to the Dharma consist in?

source: དེ་དག་ཐོས་ཀྱང་མི་འཇིགས་མི་དངང་སྐྲག་པར་མི་འགྱུར་ཏེ།
en: are not afraid, intimidated, or scared when they hear,

source: མདོ་སྡེ་ཟབ་མོ་དག་ལས་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་པ་རྒྱུད་ཆད་པ། མཚམས་སྦྱོར་བ་ལས་རྣམ་པར་གྲོལ་བ་བསྡུར་མེད་པ་
en: among the profound discourses, the Dharma teachings given by the Thus-Gone One that can sever the continuity of existence and bring an unconstrainable freedom from bondage,

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ཐོག་མ་ནས་ཞི་བའོ། །ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མྱ་ངན་ལས་འདས་པའོ་ཞེས་བསྟན་པ་
en: such as: ‘All phenomena are peace from the beginning, all phenomena are by nature the transcendence of suffering.’

source: དེ་འདི་ལྟར་ཆོས་འདི་དག་མ་ཤེས་སམ་མ་ཐོས་པར་ནི་
en: Instead, they think, ‘Without knowing or hearing such teachings

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: I would not be able to fully awaken to unexcelled and complete buddhahood.’

source: དེའི་ཕྱིར་གང་ཆོས་དེ་དག་འཛིན་པ་དང་། སེམས་པ་དང་། སྒོམ་པ་དང་། ཡོངས་སུ་རྟོག་པ་དང་། མོས་པ་འདི་ནི་ཆོས་ཀྱི་བཟོད་པ་ཞེས་བྱ་སྟེ།
en: Thus they retain such teachings, contemplate them, practice them, analyze them, and become inspired by them.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent patience with respect to the Dharma.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱིས་གནང་བའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent patience granted by the Buddha consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲོ་བའི་བསམ་པ་སྐྱེས་སམ། གནོད་སེམས་ཀྱི་བསམ་པ་སྐྱེས་ན།
en: If bodhisattvas feel anger or a wish to harm

source: འདི་ལྟར་ཁྲ་བ་འདི་གང་ནས་བྱུང་། གང་དུ་འགག །གང་ལས་འབྱུང་། ཇི་ལྟར་འབྱུང་། ཇིའི་དོན་དུ་འབྱུང་ཞེས་ཡོངས་སུ་རྟོག་སྟེ།
en: they will examine where the anger came from, where it ceases, what it arose through, how it arose, and the reason it arose.

source: དེས་དེ་ལྟར་ཡོངས་སུ་བརྟགས་ན།
en: Once they examine things in this way,

source: ཁྲ་བའི་སྐྱེ་བའང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། འགག་པའང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: they do not perceive any true emergence of anger, nor do they perceive any true ceasing of anger.

source: གང་ལས་སྐྱེ་བ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཇི་ལྟར་སྐྱེ་བ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། རྐྱེན་གང་གིས་སྐྱེ་བ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not see any true source of anger, nor any way that anger emerges, nor any conditions that caused it to arise.

source: དེ་དེའི་ཕྱིར་བཟོད་ཅིང་དང་དུ་ལེན་ལ་ཀུན་ནས་ལྡང་བ་མི་མང་བ་ཡིན་ཏེ།
en: Thus they become patient and accepting and do not develop an aggressive frame of mind.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱིས་གནང་བའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent patience granted by the Buddha.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཚེ་བ་མ་ཡིན་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent patience that is not temporary consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཉིན་པར་བཟོད་ལ་མཚན་མོ་མི་བཟོད་པའམ། མཚན་མོ་བཟོད་ལ་ཉིན་པར་མི་བཟོད་པའམ།
en: Bodhisattvas will not be patient during the day yet not at night, nor will bodhisattvas be patient at night but not during the day.

source: བདག་གི་ཡུལ་ན་བཟོད་ལ་གཞན་གྱི་ཡུལ་ན་མི་བཟོད་པའམ། གཞན་གྱི་ཡུལ་ན་བཟོད་ལ་བདག་གི་ཡུལ་ན་མི་བཟོད་པའམ།
en: They will not be patient in their own country yet impatient abroad, nor will they be patient abroad and yet not at home.

source: བཤེས་པ་ལ་བཟོད་ལ་མི་བཤེས་པ་ལ་མི་བཟོད་པའམ། མི་བཤེས་པ་ལ་བཟོད་ལ་བཤེས་པ་ལ་མི་བཟོད་པ་མ་ཡིན་གྱི།
en: They will not be patient with friends yet impatient with strangers, nor will they be patient with strangers yet impatient with friends.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་དུས་ཐམས་ཅད་དུའང་བཟོད། ཡུལ་ཐམས་ཅད་དུའང་བཟོད། ཐམས་ཅད་ལའང་བཟོད་པ་ཡིན་ཏེ།
en: Bodhisattvas are patient at all times, in all places, and with respect to everyone.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཚེ་བ་མ་ཡིན་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent patience that is not temporary.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐ་དད་པ་མེད་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent patience that does not differentiate consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་དང་། མ་དང་བླ་མ་དང་བུ་དང་བུ་མོ་དང་ཆུང་མ་དང་ཉེ་དུ་འམ་སྣག་གི་གཉེན་མཚམས་ལ་བཟོད་ལ། གཞན་ལ་མི་བཟོད་པ་མ་ཡིན་གྱི།
en: Bodhisattvas are not just patient with their fathers, mothers, masters, sons, daughters, spouses, relatives, and kinsmen, but impatient with others.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐ་ན་གདོལ་པ་གཞོན་ནུ་ཡན་ཆད་ལ་ཡང་བཟོད་དེ།
en: They will be patient even with the children of outcasts.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐ་དད་པ་མེད་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent patience that does not differentiate.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགོས་པ་ལ་མི་ལྟ་བའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent patience that is not concerned with a purpose consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དོན་གྱི་ཕྱིར་བཟོད་པ་མ་ཡིན།
en: Bodhisattvas are not patient for the sake of certain purposes,

source: འཇིགས་པའི་ཕྱིར་མ་ཡིན། ཕན་ཐོགས་སུ་རེ་བའི་ཕྱིར་མ་ཡིན།
en: or because of fear, or with the hope that it will be beneficial.

source: འཇིག་རྟེན་གྱི་ཚུལ་གྱིས་མ་ཡིན། ངོ་ཚ་བས་བཟོད་པ་མ་ཡིན་གྱི།
en: They are not patient because of mundane considerations, nor out of shame.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་རྟག་པར་ཡང་བཟོད་པ་མང་བ་ཡིན་ཏེ།
en: And yet bodhisattvas always possess abundant patience.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགོས་པ་ལ་མི་ལྟ་བའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent patience that is not concerned with a purpose.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་མི་འཁྲུགས་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent unperturbed patience consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་དེ་ལ་ཁྲོ་བ་སྐྱེ་བའི་རྐྱེན་གང་གིས་ཟིལ་གྱིས་ནོན་ན། མི་གཙིགས་པའི་ཚིག་གིས་དོན་དུ་བརྗོད་པ་དེ་ལྟ་བུའི་རྐྱེན་མ་བྱུང་གི་བར་དུ་བཟོད་པ་མ་ཡིན་གྱི།
en: Bodhisattvas are not just patient as long as they do not find themselves in a situation where anger otherwise takes over,

source: ཁུ་ཚུར་གྱིས་འཚོག་པར་འགྱུར་བའམ། ཐལ་མོས་འཚོག་པར་འགྱུར་བའམ། དབྱིག་པས་རྡེག་པར་འགྱུར་བའམ། མཚོན་གྱིས་འདེབས་པར་འགྱུར་བའམ།
en: such as when they are hit, slapped, beaten, wounded, or abused by others.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་གལ་ཏེ་ལ་ལ་ཞིག་གིས་བརྡེགས་སམ། བསྡིགས་སམ། སྤྱོས་སམ། བརྒྱད་ན།
en: Rather, if others strike bodhisattvas, threaten them, insult them, or beat them,

source: བདག་ཉིད་ཀྱིས་ལས་འདི་དག་བྱས་ཏེ། བདག་ཉིད་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ།
en: ‘This is the ripening of actions I did in the past. I created this karma, so now it ripens on me.

source: མས་མ་བྱས། ཕས་མ་བྱས། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་གང་ཡང་རུང་བ་དག་གིས་མ་བྱས་ཏེ།
en: My mother, father, relatives, and kinsmen did not do those acts.

source: ལས་འདི་དག་བདག་ཉིད་ཀྱིས་བྱས་པས། དེའི་ཕྱིར་བདག་ཉིད་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་གྱི།
en: Since I am the one who did them, their ripening happens to me.

source: ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར། དེ་བཞིན་དུ་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་རོ།
en: Such acts do not ripen in the outer element of earth, nor do they ripen in the outer elements of water, fire, or wind.

source: དེ་བཞིན་དུ་ནང་གི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར།
en: They do not ripen in the inner element of earth,

source: དེ་བཞིན་དུ་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་རོ་
en: nor do they ripen on the inner elements of water, fire, or wind.’

source: སྙམ་དུ་སེམས་གཞག་པར་བྱའོ།
en: Keeping those insights in mind,

source: དེ་དེ་ལྟར་མ་ལོག་པར་རྟོགས་པས་དེའི་རྒྱུ་དེའི་རྐྱེན། དེའི་གཞིས་རྣམ་པར་དཀྲུགས་ཀྱང་བཟོད། རྣམ་པར་མ་དཀྲུགས་ཀྱང་བཟོད་དེ།
en: regardless of whether the causes, conditions, and bases for such disturbances unfold or not.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་མི་འཁྲུགས་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent unperturbed patience.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent compassionate patience consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་པོའམ། བློན་པོ་ཆེན་པོ་ཕྱུག་ཅིང་ནོར་མང་བ། ལོངས་སྤྱོད་ཆེ་བ།
en: A bodhisattva may be a king or a great minister who is rich, wealthy, in possession of many enjoyments,

source: སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ཀྱི་བདག་པོར་གྱུར་ལ།
en: and the ruler of many suffering beings.

source: དེ་ལ་སེམས་ཅན་དེ་དག་གིས་མི་སྙན་པར་བརྗོད་ཀྱང་རུང་། ཀྱལ་ཀྱང་རུང་། གཙེས་ཀྱང་རུང་སྟེ།
en: Even if the beings governed by them are critical, gossip, or speak inappropriately,

source: མི་ཁྲོ་ཞིང་གནོད་སེམས་སུ་མི་བྱེད་ལ།
en: the bodhisattva will not be angry or hostile.

source: བདག་པོར་གྱུར་པ་ལྟ་བུར་མི་སྟོན་གྱི།
en: Rather than acting as a ruler,

source: འདི་སྙམ་དུ་སེམས་ཅན་འདི་དག་ནི་བདག་ཉིད་ཀྱིས་བཟུང་བ་སྟེ། སེམས་ཅན་འདི་དག་ནི་བདག་ཉིད་ཀྱིས་ཡོངས་སུ་བསྐྱང་པར་བྱ་བ་ཡིན་ལ། དེ་ལྟར་ཡོངས་སུ་བསྲུང་བ་ན།
en: bodhisattvas will instead think to themselves, ‘These beings are under my care and I must provide for them.

source: བརླག་པར་བྱ་བ་ནི་བདག་གི་མི་ཆའོ་ཞེས།
en: Destroying those who are under my care would be wrong.’

source: དེ་དེའི་ཕྱིར་སྙིང་རྗེའི་སེམས་ཉེ་བར་གཞག་སྟེ།
en: Thus they embrace such beings with compassion,

source: བཟོད་ཅིང་དང་དུ་ལེན་ལ་གནོད་སེམས་མི་མང་བ་ཡིན་ཏེ།
en: and patiently accept them without any ill will.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent compassionate patience.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དམ་བཅས་པ་ལས་སྒྲོལ་བའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may then wonder about the character of the bodhisattvas’ excellent patience that liberates based on a commitment.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་
en: In this regard, bodhisattvas think as follows:

source: བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་སྤྱན་སྔར་
en: ‘Before the blessed, worthy, thus-gone, perfect buddhas

source: བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: I have pledged to fully awaken to unexcelled and perfect buddhahood and

source: འཁོར་བའི་རྒྱ་མཚོའི་འདམ་དུ་བྱིང་བའི་སེམས་ཅན་རྣམས་བསྒྲལ་བར་བགྱིའོ་
en: liberate all beings who are sinking in the oceanic swamp of cyclic existence.

source: ཞེས་སེང་གེའི་སྒྲ་བསྒྲགས་ཀྱིས། དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དགྲོལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དུལ་བ་དང་། ཞི་བ་ལ་རབ་ཏུ་དགོད་པར་བརྩོན་ལ།
en: With that lion’s roar I promised to liberate, deliver, and train all beings, establishing them in perfect peace.

source: བདག་ཉིད་ཁྲོ་བ་མང་བ་དང་། གནོད་སེམས་མང་བ་དང་། མི་བཟོད་པ་མང་བ་དང་། ཕོག་སྙ་མེད་པ་ནི་བདག་གི་མི་ཆའོ་སྙམ་དུ་སེམས་སོ།
en: So it would be wrong if I were to become angry, aggressive, intolerant, and lacking in forbearance.’

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་སྨན་པ་ཐུར་མ་ཅན་ཞིག་ཡོད་ལ། སེམས་ཅན་རྣམས་ཀྱང་རབ་རིབ་ཀྱིས་ལྡོངས་པར་གྱུར་ན།
en: “Noble son, think of a doctor suffering from cataracts.

source: སྨན་པ་དེས་འདི་སྙམ་དུ་བདག་གིས་སེམས་ཅན་འདི་དག་གི་རབ་རིབ་ཀྱི་སྐྱོན་བསལ་བར་བྱའོ། །ཞེས་བསམས་ལ།
en: When there are other beings blinded by cataracts that doctor may think, ‘I shall cure all these beings of their blindness.’

source: དེ་ནས་སྨན་པ་དེ་བདག་ཉིད་ཀྱང་ལྡོངས་པར་གྱུར་ན། རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས།
en: But, noble son, if he himself is blind,

source: ཇི་ག་སྨན་པ་དེས་སེམས་ཅན་དེ་དག་གི་རབ་རིབ་ཀྱི་སྐྱོན་ཐམས་ཅད་བསལ་བར་ནུས་སམ། གསོལ་པ།
en: will he then be able to relieve all those beings of their cataracts?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: “Blessed One,” replied Sarva­nīvaraṇa­viṣkam­bhin, “he will not be able to do so.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་
en: “Noble son,” the Blessed One continued,

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཇི་ལྟར་འཇིག་རྟེན་མི་ཤེས་པའི་རབ་རིབ་ཀྱིས་ལྡོངས་པའི་
en: “bodhisattvas similarly wish to relieve the blind world of its cataracts of ignorance.

source: གཏི་མུག་གི་དྲི་མ་ཤེས་རབ་ཀྱི་མིག་གིས་བསལ་བར་འདོད་ལ།
en: They wish the eye of insight to clear away the stains of unknowing

source: བདག་ཉིད་ཀྱང་མི་ཤེས་པའི་རབ་རིབ་ཀྱིས་ལྡོངས་ན་བདག་གི་མི་ཆའོ་སྙམ་དུ་སེམས་ཏེ།
en: so they realize that it would be wrong if they themselves remained blinded by the cataracts of ignorance.

source: དེ་དེའི་ཕྱིར་བཟོད་ཅིང་དང་དུ་ལེན་ལ་གནོད་སེམས་མི་མང་བ་ཡིན་ཏེ།
en: Hence they practice patience and tolerant acceptance, free from malicious intent.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དམ་བཅས་པ་ལས་སྒྲོལ་བར་བྱེད་པའི་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent patience that liberates based on commitment.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།།
en: Noble son, such then is the bodhisattvas’ practice of excellent patience.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who practice excellent diligence possess ten qualities.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those ten? They are

source: འདི་ལྟ་སྟེ། རྡོ་རྗེ་ལྟ་བུའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། མི་འཕྲོགས་པའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། མཐའ་གཉིས་དང་བྲལ་བའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། རླབས་པོ་ཆེའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། འབར་བའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། རྒྱུན་དུ་ཆུད་པའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། རྣམ་པར་དག་པའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། ཐུན་མོང་མ་ཡིན་པའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། མི་བརྙས་པའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན། སྙེམས་པ་མེད་པའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན་ནོ།
en: They are vajra-like diligence, inalienable diligence, diligence free of the two extremes, vast diligence, blazing diligence, continuous diligence, pure diligence, extraordinary diligence, diligence that does not deprecate, and diligence that is free of conceit.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་རྡོ་རྗེ་ལྟ་བུའི་བརྩོན་འགྲུས་ཅན་རྣམས་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent vajra-like diligence consist in?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་ཁམས་
en: Noble son, bodhisattvas muster diligence for the sake of the realms of beings.

source: ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བ་དང་།
en: They are diligent so that those who have not transcended suffering can go beyond it,

source: མ་རྒལ་བ་བསྒྲལ་བ་དང་།
en: those who have not yet crossed can be delivered,

source: མ་གྲོལ་བ་དགྲོལ་བ་དང་།
en: those who are not yet liberated may be free,

source: དབུགས་མ་ཕྱིན་པ་དབུགས་དབྱུང་བ་དང་།
en: those who are not yet assured may receive assurance,

source: མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་ཏེ།
en: so that those who have not yet truly and completely awakened may truly and completely awaken.

source: གནས་པའི་དྲུང་དུ་བདུད་སྡིག་ཏོ་ཅན་འོངས་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་
en: “The māra Pāpīyān might go before such a bodhisattva

source: རིགས་ཀྱི་བུ་འདི་ལྟ་བུའི་བརྩོན་འགྲུས་ཐོང་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: ‘Noble son, give up your diligent practice. Why?

source: རིགས་ཀྱི་བུ་ངས་ཀྱང་སེམས་ཅན་གྱི་ཁམས་ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་ཡོངས་སུ་མྱ་ངན་ལ་བཟླ་བ་དང་།
en: Noble son, you are diligent so that all those who are not already beyond suffering can transcend suffering.

source: དེ་ནི་བརྫུན་དང་འདྲིད་པའི་ཆོས་ཅན་བྱིས་པའི་སྐྱེ་བོ་སླུ་བའོ།
en: Yet that sort of diligence is false and deceptive, and it fools childish beings.

source: རིགས་ཀྱི་བུ་ངས་ནི་སེམས་ཅན་བརྩོན་འགྲུས་བརྩམས་པ་གཅིག་འགས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་མ་ཤེས་སོ།
en: Noble son, I do not know of a single sentient being who has fully awakened to unexcelled and complete buddhahood through mustering such diligence.
